{
    "block": {
        "blockHeight": "Also known as Block Number. The block height, which indicates the length of the blockchain, increases after the addition of the new block.",
        "timestamp": "The date and time at which a block is produced.",
        "transactions": "The number of transactions in the block. Internal transaction is transactions as a result of contract execution that involves Ether value.",
        "feeRecipient": "Address receiving fees from transactions in this block.",
        "blockReward": "For each block, the block producer is rewarded with a finite amount of Ether on top of the fees paid for all transactions in the block.",
        "totalDifficulty": "Total difficulty of the chain until this block.",
        "gasUsed": "The total gas used in the block and its percentage of gas filled in the block.",
        "gasLimit": "Total gas limit provided by all transactions in the block.",
        "baseFeePerGas": "Post-London Upgrade, this represents the minimum gasUsed multiplier required for a tx to be included in a block.",
        "burntFees": "Post-London Upgrade, this represents the part of the tx fee that is burnt: baseFeePerGas * gasUsed.",
        "extraData": "Any data that can be included by the block producer in the block."
    },
    "transaction": {
        "txHash": "A TxHash or transaction hash is a unique 66-character identifier that is generated whenever a transaction is executed.",
        "block": "Number of the block in which the transaction is recorded. Block confirmations indicate how many blocks have been added since the transaction was produced.",
        "timestamp": "The date and time at which a transaction is produced.",
        "from": "The sending party of the transaction.",
        "to": "The receiving party of the transaction (could be a contract address).",
        "value": "The value being transacted in Ether and fiat value. Note: You can click the fiat value (if available) to see historical value at the time of transaction.",
        "txFee": "Amount paid to process the transaction in Ether and fiat value.",
        "gasLimitUsage": "Maximum amount of gas allocated for the transaction & the amount eventually used. Normal ETH transfers involve 21,000 gas units while contracts involve higher values.",
        "gasFees": "Base Fee refers to the network Base Fee at the time of the block, while Max Fee & Max Priority Fee refer to the max amount a user is willing to pay for their tx & to give to the block producer respectively.",
        "burntSavingFees": "Total amount of ETH burnt from this tx & total fees saved from the amount the user was willing to pay for this tx.",
        "otherAttributes": "Other data related to this transaction.",
        "inputData": "Additional data included for this transaction. Commonly used as part of contract interaction or as a message sent to the recipient."
    }
}